# Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года относится месяц
# (зима, весна, лето, осень). Напишите решения через list и через dict

season_list = ("зима", "весна", "лето", "осень")
season_dict = {1: "зима", 2: "зима", 12: "зима",
               3: "весна", 4: "весна", 5: "весна",
               6: "лето", 7: "лето", 8: "лето",
               9: "осень", 10: "осень", 11: "осень"}
month = 48
while (1 > month) or (month > 12):
    month = int(input("Введи порядковый номер месяца"))
print("через list", season_list[(month % 12) // 3])

print("через dict", season_dict.get(month))
